# числа от 1 до 9 написаны в ряд, 
# можно вставить + и - в любое место, нужно найти все комбинации, сумма которых = 100

row = [1, 2, 3, 4, 5, 6, 7, 8, 9, 12, 23, 34, 45, 56, 67, 78, 89, 123, 234, 345, 456, 567, 678, 789, 
          1234, 2345, 3456, 4567, 5678, 6789, 12345, 23456, 34567, 45678, 56789, -1, -2, -3, -4, -5, -6,
            -7, -8, -9, -12, -23, -34, -45, -56, -67, -78, -89, -123, -234, -345, -456, -567, -678, -789, 
          -1234, -2345, -3456, -4567, -5678, -6789, -12345, -23456, -34567, -45678, -56789]
for a in row:
    for b in row:
        for c in row:
            for d in row:
                for e in row:
                    if a + b + c + d + e == 100 and a != b and a != c and a != d and a != e and b != c and b != d and b != e and c != d and c != e and d != e:
                        print(a, b, c, d, e)

